#include "common.h"

/* Private Macros ---------------------------------------------------------- */

/* Private Variables ------------------------------------------------------- */

static u8 p_us  = 0;
static u16 p_ms = 0;

/* Global Variables -------------------------------------------------------- */

/* Global Functions -------------------------------------------------------- */

/* 阻塞延时 ******************** */

/******************************************************************
 * \brief  初始化延时函数
 */
void delay_init(void)
{
    p_us = SystemCoreClock / 8000000;
    p_ms = (u16)p_us * 1000;
}

/******************************************************************
 * \brief      微秒级延时
 * \param[in]  us 延时时长，范围：0..25,565,281
 * \note       阻塞式延时，基于 SysTick 定时器实现
 */
void delay_us(u32 us)
{
    u32 i;

    SysTick->SR &= ~(1 << 0);
    i = (u32)us * p_us;

    SysTick->CMP = i;
    SysTick->CTLR |= (1 << 4);
    SysTick->CTLR |= (1 << 5) | (1 << 0);

    while ((SysTick->SR & (1 << 0)) != (1 << 0));
    SysTick->CTLR &= ~(1 << 0);
}

/******************************************************************
 * \brief      毫秒级延时
 * \param[in]  ms 延时时长，范围：0..4,294,967,295
 * \note       阻塞式延时，基于 SysTick 定时器实现
 */
void delay_ms(u32 ms)
{
    u32 i;

    SysTick->SR &= ~(1 << 0);
    i = (u32)ms * p_ms;

    SysTick->CMP = i;
    SysTick->CTLR |= (1 << 4);
    SysTick->CTLR |= (1 << 5) | (1 << 0);

    while ((SysTick->SR & (1 << 0)) != (1 << 0));
    SysTick->CTLR &= ~(1 << 0);
}

/******************************************************************
 * \brief      秒级延时
 * \param[in]  s 延时时长，范围：0..4,294,967,295
 * \note       阻塞式延时，基于 SysTick 定时器实现
 */
void delay_s(u32 s)
{
    while (s--)
        delay_ms(1000);
}

/* ******************** 阻塞延时 */
