#include "sys.h"

/* Private Macros ---------------------------------------------------------- */

#define SECBASE 100 // 秒基数，单位为 10ms

/* Private Variables ------------------------------------------------------- */

/* Global Variables -------------------------------------------------------- */

__IO u32 sysTime = 0; // 系统时间，单位为 10ms

/* Global Functions -------------------------------------------------------- */

/******************************************************************
 * \brief  系统主函数
 * \note   可在此函数内编写自己的程序代码
 */
void loop(void)
{
    while (1) {
        if (key_read(key1))
            led_turn(led1);
            
        // ...你的代码...
    }
}
